nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
/*
 * Copyright (c) 2022 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

/* @file
 * @brief NRF Wi-Fi radio test shell module
 */

#include <nrf_wifi_radio_test_shell.h>
#include <util.h>

#include "radio_test/fmac_api.h"
#include <radio_test/nrf70_bm_core.h>
#include <radio_test/nrf70_bm_lib.h>

#ifdef CONFIG_ZEPHYR_SHELL
struct shell *shell_global;
#endif /* CONFIG_ZEPHYR_SHELL */

extern struct nrf70_bm_rt_wifi_drv_priv nrf70_bm_rt_priv;
struct nrf70_bm_rt_wifi_ctx *ctx = &nrf70_bm_rt_priv.rpu_ctx_bm;

static bool check_test_in_prog() {
  if (ctx->conf_params.rx) {
    RT_SHELL_PRINTF_ERROR("Disable RX\n");
    return false;
  }

  if (ctx->conf_params.tx) {
    RT_SHELL_PRINTF_ERROR("Disable TX\n");
    return false;
  }

  if (ctx->rf_test_run) {
    RT_SHELL_PRINTF_ERROR("Disable RF Test (%d)\n", ctx->rf_test);
    return false;
  }
  return true;
}

static bool check_valid_data_rate(unsigned char tput_mode, unsigned int nss,
                                  int dr) {
  bool is_mcs = dr & 0x80;
  bool ret = false;

  if (dr == -1)
    return true;

  if (is_mcs) {
    dr = dr & 0x7F;

    if (tput_mode & RPU_TPUT_MODE_HT) {
      if (nss == 2) {
        if ((dr >= 8) && (dr <= 15)) {
          ret = true;
        } else {
          RT_SHELL_PRINTF_ERROR("Invalid MIMO HT MCS: %d\n", dr);
        }
      }

      if (nss == 1) {
        if ((dr >= 0) && (dr <= 7)) {
          ret = true;
        } else {
          RT_SHELL_PRINTF_ERROR("Invalid SISO HT MCS: %d\n", dr);
        }
      }

    } else if (tput_mode == RPU_TPUT_MODE_VHT) {
      if ((dr >= 0 && dr <= 9)) {
        ret = true;
      } else {
        RT_SHELL_PRINTF_ERROR("Invalid VHT MCS value: %d\n", dr);
      }
    } else if (tput_mode == RPU_TPUT_MODE_HE_SU) {
      if ((dr >= 0 && dr <= 7)) {
        ret = true;
      } else {
        RT_SHELL_PRINTF_ERROR("Invalid HE_SU MCS value: %d\n", dr);
      }
    } else if (tput_mode == RPU_TPUT_MODE_HE_ER_SU) {
      if ((dr >= 0 && dr <= 2)) {
        ret = true;
      } else {
        RT_SHELL_PRINTF_ERROR("Invalid HE_ER_SU MCS value: %d\n", dr);
      }
    } else {
      RT_SHELL_PRINTF_ERROR("%s: Invalid throughput mode: %d\n", __func__, dr);
    }
  } else {
    if (tput_mode != RPU_TPUT_MODE_LEGACY) {
      ret = false;

      RT_SHELL_PRINTF_ERROR("Invalid rate_flags for legacy: %d\n", dr);
    }

    if ((dr == 1) || (dr == 2) || (dr == 55) || (dr == 11) || (dr == 6) ||
        (dr == 9) || (dr == 12) || (dr == 18) || (dr == 24) || (dr == 36) ||
        (dr == 48) || (dr == 54) || (dr == -1)) {
      ret = true;
    } else {
      RT_SHELL_PRINTF_ERROR("Invalid Legacy Rate value: %d\n", dr);
    }
  }

  return ret;
}

static bool check_valid_chan_2g(unsigned char chan_num) {
  if ((chan_num >= 1) && (chan_num <= 14)) {
    return true;
  }

  return false;
}

#ifndef CONFIG_NRF70_2_4G_ONLY
static bool check_valid_chan_5g(unsigned char chan_num) {
  if ((chan_num == 32) || (chan_num == 36) || (chan_num == 40) ||
      (chan_num == 44) || (chan_num == 48) || (chan_num == 52) ||
      (chan_num == 56) || (chan_num == 60) || (chan_num == 64) ||
      (chan_num == 68) || (chan_num == 96) || (chan_num == 100) ||
      (chan_num == 104) || (chan_num == 108) || (chan_num == 112) ||
      (chan_num == 116) || (chan_num == 120) || (chan_num == 124) ||
      (chan_num == 128) || (chan_num == 132) || (chan_num == 136) ||
      (chan_num == 140) || (chan_num == 144) || (chan_num == 149) ||
      (chan_num == 153) || (chan_num == 157) || (chan_num == 159) ||
      (chan_num == 161) || (chan_num == 163) || (chan_num == 165) ||
      (chan_num == 167) || (chan_num == 169) || (chan_num == 171) ||
      (chan_num == 173) || (chan_num == 175) || (chan_num == 177)) {
    return true;
  }

  return false;
}
#endif /* CONFIG_NRF70_2_4G_ONLY */

static bool check_valid_channel(unsigned char chan_num) {
  bool ret = false;

  ret = check_valid_chan_2g(chan_num);

  if (ret) {
    goto out;
  }

#ifndef CONFIG_NRF70_2_4G_ONLY
  ret = check_valid_chan_5g(chan_num);
#endif /* CONFIG_NRF70_2_4G_ONLY */

out:
  return ret;
}

static int check_channel_settings(unsigned char tput_mode,
                                  struct chan_params *chan) {
  if (tput_mode == RPU_TPUT_MODE_LEGACY) {
    if (chan->bw != RPU_CH_BW_20) {
      RT_SHELL_PRINTF_ERROR(
          "Invalid bandwidth setting for legacy channel = %d\n",
          chan->primary_num);
      return -1;
    }
  } else if (tput_mode == RPU_TPUT_MODE_HT) {
    if (chan->bw != RPU_CH_BW_20) {
      RT_SHELL_PRINTF_ERROR("Invalid bandwidth setting for HT channel = %d\n",
                            chan->primary_num);
      return -1;
    }
  } else if (tput_mode == RPU_TPUT_MODE_VHT) {
    if ((chan->primary_num >= 1) && (chan->primary_num <= 14)) {
      RT_SHELL_PRINTF_ERROR("VHT setting not allowed in 2.4GHz band\n");
      return -1;
    }

    if (chan->bw != RPU_CH_BW_20) {
      RT_SHELL_PRINTF_ERROR("Invalid bandwidth setting for VHT channel = %d\n",
                            chan->primary_num);
      return -1;
    }
  } else if ((tput_mode == RPU_TPUT_MODE_HE_SU) ||
             (tput_mode == RPU_TPUT_MODE_HE_TB) ||
             (tput_mode == RPU_TPUT_MODE_HE_ER_SU)) {
    if (chan->bw != RPU_CH_BW_20) {
      RT_SHELL_PRINTF_ERROR("Invalid bandwidth setting for HE channel = %d\n",
                            chan->primary_num);
      return -1;
    }
  } else {
    RT_SHELL_PRINTF_ERROR("Invalid throughput mode = %d\n", tput_mode);
    return -1;
  }

  return 0;
}

static int nrf_wifi_init(size_t argc, const char *argv[])
{
	int ret = 0;
	struct nrf70_bm_regulatory_info reg_info = { 0 };

	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	memcpy(reg_info.country_code, CONFIG_WIFI_RT_REG_DOMAIN, 2);
	reg_info.force = true;

	/* Initialize the Wi-Fi module */
	ret = nrf70_bm_rt_init(&reg_info);
	if (ret) {
		printf("Failed to initialize WiFi module\n");
		goto cleanup;
	}
	printf("Initialized WiFi module, ready for radio test\n");

cleanup:
	if (ret) {
		nrf70_bm_rt_deinit();
		printf("Exiting WiFi radio test sample application with error: %d\n", ret);
	}
	return ret;
}

static int nrf_wifi_deinit(size_t argc, const char *argv[])
{
  int ret;

