nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
  ARG_UNUSED(argc);
  ARG_UNUSED(argv);

  ret = nrf70_bm_rt_deinit();
  if (ret) {
    printf("Failed to deinitialize WiFi module\n");
    return ret;
  }

  printf("Deinitialized WiFi module\n");

  return 0;
}


enum nrf_wifi_status
nrf_wifi_radio_test_conf_init(struct rpu_conf_params *conf_params) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  unsigned char country_code[NRF_WIFI_COUNTRY_CODE_LEN] = {0};

  /* Check and save regulatory country code currently set */
  if (strlen(conf_params->country_code)) {
    memcpy(country_code, conf_params->country_code, NRF_WIFI_COUNTRY_CODE_LEN);
  }

  memset(conf_params, 0, sizeof(*conf_params));

  /* Initialize values which are other than 0 */
  conf_params->op_mode = RPU_OP_MODE_RADIO_TEST;

  status = nrf_wifi_rt_fmac_rf_params_get(
      ctx->rpu_ctx, (struct nrf_wifi_phy_rf_params *)conf_params->rf_params);
  if (status != NRF_WIFI_STATUS_SUCCESS) {
    goto out;
  }

  conf_params->tx_pkt_nss = 1;
  conf_params->tx_pkt_gap_us = 0;

  conf_params->tx_power = MAX_TX_PWR_SYS_TEST;

  conf_params->chan.primary_num = 1;
  conf_params->tx_mode = 1;
  conf_params->tx_pkt_num = -1;
  conf_params->tx_pkt_len = 1400;
  conf_params->tx_pkt_preamble = 0;
  conf_params->tx_pkt_rate = 6;
  conf_params->he_ltf = 2;
  conf_params->he_gi = 2;
  conf_params->aux_adc_input_chain_id = 1;
  conf_params->ru_tone = 26;
  conf_params->ru_index = 1;
  conf_params->tx_pkt_cw = 15;
  conf_params->phy_calib = NRF_WIFI_DEF_PHY_CALIB;

  /* Store back the currently set country code */
  if (strlen(country_code)) {
    memcpy(conf_params->country_code, country_code, NRF_WIFI_COUNTRY_CODE_LEN);
  } else {
    memcpy(conf_params->country_code, "00", NRF_WIFI_COUNTRY_CODE_LEN);
  }
out:
  return status;
}

static int nrf_wifi_radio_test_set_defaults(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  status = nrf_wifi_radio_test_conf_init(&ctx->conf_params);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("Configuration init failed\n");
    return -ENOEXEC;
  }

  return 0;
}

static int nrf_wifi_radio_test_set_phy_calib_rxdc(size_t argc,
                                                  const char *argv[]) {
  char *ptr = NULL;
  unsigned long phy_calib_rxdc = 0;

  phy_calib_rxdc = strtoul(argv[1], &ptr, 10);

  if (phy_calib_rxdc > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid PHY RX DC calibration value(%lu).\n",
                          phy_calib_rxdc);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (phy_calib_rxdc)
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib | NRF_WIFI_PHY_CALIB_FLAG_RXDC);
  else
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib & ~(NRF_WIFI_PHY_CALIB_FLAG_RXDC));

  return 0;
}

static int nrf_wifi_radio_test_set_phy_calib_txdc(size_t argc,
                                                  const char *argv[]) {
  char *ptr = NULL;
  unsigned long phy_calib_txdc = 0;

  phy_calib_txdc = strtoul(argv[1], &ptr, 10);

  if (phy_calib_txdc > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid PHY TX DC calibration value(%lu).\n",
                          phy_calib_txdc);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (phy_calib_txdc)
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib | NRF_WIFI_PHY_CALIB_FLAG_TXDC);
  else
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib & ~(NRF_WIFI_PHY_CALIB_FLAG_TXDC));

  return 0;
}

static int nrf_wifi_radio_test_set_phy_calib_txpow(size_t argc,
                                                   const char *argv[]) {
  char *ptr = NULL;
  unsigned long phy_calib_txpow = 0;

  phy_calib_txpow = strtoul(argv[1], &ptr, 10);

  if (phy_calib_txpow > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid PHY TX power calibration value(%lu).\n",
                          phy_calib_txpow);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (phy_calib_txpow)
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib | NRF_WIFI_PHY_CALIB_FLAG_TXPOW);
  else
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib & ~(NRF_WIFI_PHY_CALIB_FLAG_TXPOW));

  return 0;
}

static int nrf_wifi_radio_test_set_phy_calib_rxiq(size_t argc,
                                                  const char *argv[]) {
  char *ptr = NULL;
  unsigned long phy_calib_rxiq = 0;

  phy_calib_rxiq = strtoul(argv[1], &ptr, 10);

  if (phy_calib_rxiq > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid PHY RX IQ calibration value(%lu).\n",
                          phy_calib_rxiq);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (phy_calib_rxiq)
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib | NRF_WIFI_PHY_CALIB_FLAG_RXIQ);
  else
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib & ~(NRF_WIFI_PHY_CALIB_FLAG_RXIQ));

  return 0;
}

static int nrf_wifi_radio_test_set_phy_calib_txiq(size_t argc,
                                                  const char *argv[]) {
  char *ptr = NULL;
  unsigned long phy_calib_txiq = 0;

  phy_calib_txiq = strtoul(argv[1], &ptr, 10);

  if (phy_calib_txiq > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid PHY TX IQ calibration value(%lu).\n",
                          phy_calib_txiq);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (phy_calib_txiq)
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib | NRF_WIFI_PHY_CALIB_FLAG_TXIQ);
  else
    ctx->conf_params.phy_calib =
        (ctx->conf_params.phy_calib & ~(NRF_WIFI_PHY_CALIB_FLAG_TXIQ));
  return 0;
}

static int nrf_wifi_radio_test_set_he_ltf(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long he_ltf = 0;

  he_ltf = strtoul(argv[1], &ptr, 10);

  if (he_ltf > 2) {
    RT_SHELL_PRINTF_ERROR("Invalid HE LTF value(%lu).\n", he_ltf);

    return -ENOEXEC;
  }

