nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
  ctx->conf_params.he_ltf = he_ltf;

  return 0;
}

static int nrf_wifi_radio_test_set_he_gi(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long he_gi = 0;

  he_gi = strtoul(argv[1], &ptr, 10);

  if (he_gi > 2) {
    RT_SHELL_PRINTF_ERROR("Invalid HE GI value(%lu).\n", he_gi);

    return -ENOEXEC;
  }

  ctx->conf_params.he_gi = he_gi;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_tput_mode(size_t argc,
                                                    const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val >= RPU_TPUT_MODE_MAX) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_tput_mode = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_sgi(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_sgi = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_preamble(size_t argc,
                                                   const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val >= RPU_PKT_PREAMBLE_MAX) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (ctx->conf_params.tx_pkt_tput_mode == 0) {
    if ((val != RPU_PKT_PREAMBLE_SHORT) && (val != RPU_PKT_PREAMBLE_LONG)) {
      RT_SHELL_PRINTF_ERROR("Invalid value %lu for legacy mode\n", val);
      return -ENOEXEC;
    }
  } else {
    if (val != RPU_PKT_PREAMBLE_MIXED) {
      RT_SHELL_PRINTF_ERROR(
          "Only mixed preamble mode supported in HT, VHT and HE modes\n");
      return -ENOEXEC;
    }
  }

  ctx->conf_params.tx_pkt_preamble = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_mcs(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  long val = -1;

  val = strtol(argv[1], &ptr, 10);

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (!(check_valid_data_rate(ctx->conf_params.tx_pkt_tput_mode,
                              ctx->conf_params.tx_pkt_nss, (val | 0x80)))) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_mcs = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_rate(size_t argc,
                                               const char *argv[]) {
  char *ptr = NULL;
  long val = -1;

  val = strtol(argv[1], &ptr, 10);

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  if (!(check_valid_data_rate(ctx->conf_params.tx_pkt_tput_mode,
                              ctx->conf_params.tx_pkt_nss, val))) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_rate = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_gap(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 200000) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_gap_us = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_num(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  long val = 0;

  val = strtol(argv[1], &ptr, 10);

  if ((val < -1) || (val == 0)) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_num = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_len(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val == 0) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (ctx->conf_params.tx_pkt_tput_mode == RPU_TPUT_MODE_MAX) {
    RT_SHELL_PRINTF_ERROR("Throughput mode not set\n");
    return -ENOEXEC;
  }

  if (ctx->conf_params.tx_pkt_tput_mode == RPU_TPUT_MODE_LEGACY) {
    if (val > 4000) {
      RT_SHELL_PRINTF_ERROR("max 'tx_pkt_len' size for legacy is 4000 bytes\n");
      return -ENOEXEC;
    }
  } else if (ctx->conf_params.tx_pkt_tput_mode == RPU_TPUT_MODE_HE_TB) {
    if (ctx->conf_params.ru_tone == 26) {
      if (val >= 350) {
        RT_SHELL_PRINTF_ERROR("'tx_pkt_len' has to be less than 350 bytes\n");
        return -ENOEXEC;
      }
    } else if (ctx->conf_params.ru_tone == 52) {
      if (val >= 800) {
        RT_SHELL_PRINTF_ERROR("'tx_pkt_len' has to be less than 800 bytes\n");
        return -ENOEXEC;
      }
    } else if (ctx->conf_params.ru_tone == 106) {
      if (val >= 1800) {
        RT_SHELL_PRINTF_ERROR("'tx_pkt_len' has to be less than 1800 bytes\n");
        return -ENOEXEC;
      }
    } else if (ctx->conf_params.ru_tone == 242) {
      if (val >= 4000) {
        RT_SHELL_PRINTF_ERROR("'tx_pkt_len' has to be less than 4000 bytes\n");
        return -ENOEXEC;
      }
    } else {
      RT_SHELL_PRINTF_ERROR("'ru_tone' not set\n");
      return -ENOEXEC;
    }
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_len = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_power(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (((val > MAX_TX_PWR_RADIO_TEST) && (val != MAX_TX_PWR_SYS_TEST))) {
    RT_SHELL_PRINTF_ERROR("Invalid TX power setting\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_power = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx_tone_freq(size_t argc,
                                                const char *argv[]) {
  char *ptr = NULL;
  signed char val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if ((val > 10) || (val < -10)) {
    RT_SHELL_PRINTF_ERROR("'tx_tone_freq' has to be in between -10 to +10\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_tone_freq = val;

