nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
  return 0;
}

static int nrf_wifi_radio_test_set_rx_lna_gain(size_t argc,
                                               const char *argv[]) {
  char *ptr = NULL;
  signed char val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if ((val > 4) || (val < 0)) {
    RT_SHELL_PRINTF_ERROR("'lna_gain' has to be in between 0 to 4\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.lna_gain = val;

  return 0;
}

static int nrf_wifi_radio_test_set_rx_bb_gain(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  signed char val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if ((val > 31) || (val < 0)) {
    RT_SHELL_PRINTF_ERROR("'bb_gain' has to be in between 0 to 31\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.bb_gain = val;

  return 0;
}

static int nrf_wifi_radio_test_set_rx_capture_length(size_t argc,
                                                     const char *argv[]) {
  char *ptr = NULL;
  unsigned short int val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val >= 16384) {
    RT_SHELL_PRINTF_ERROR("'capture_length' has to be less than 16384\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.capture_length = val;

  return 0;
}

static int nrf_wifi_radio_test_set_rx_capture_timeout(size_t argc,
                                                     const char *argv[]) {
	char *ptr = NULL;
	unsigned short int val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if (val > CAPTURE_DURATION_IN_SEC) {
		RT_SHELL_PRINTF_ERROR("'capture_timeout' has to be less than or equal to %d seconds\n", CAPTURE_DURATION_IN_SEC);
		return -ENOEXEC;
	}

	if (!check_test_in_prog()) {
		return -ENOEXEC;
	}

	ctx->conf_params.capture_timeout = val;

	return 0;
}

static int nrf_wifi_radio_test_set_ru_tone(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if ((val != 26) && (val != 52) && (val != 106) && (val != 242)) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.ru_tone = val;

  return 0;
}

static int nrf_wifi_radio_test_set_ru_index(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (ctx->conf_params.ru_tone == 26) {
    if ((val < 1) || (val > 9)) {
      RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

      return -ENOEXEC;
    }
  } else if (ctx->conf_params.ru_tone == 52) {
    if ((val < 1) || (val > 4)) {
      RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

      return -ENOEXEC;
    }
  } else if (ctx->conf_params.ru_tone == 106) {
    if ((val < 1) || (val > 2)) {
      RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

      return -ENOEXEC;
    }
  } else if (ctx->conf_params.ru_tone == 242) {
    if ((val != 1)) {
      RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

      return -ENOEXEC;
    }
  } else {
    RT_SHELL_PRINTF_ERROR("RU tone not set\n");

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.ru_index = val;

  return 0;
}

static int nrf_wifi_radio_test_init(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (!(check_valid_channel(val))) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);
    return -ENOEXEC;
  }

  if (ctx->conf_params.rx) {
    RT_SHELL_PRINTF_INFO("Disabling ongoing RX test\n");
    ctx->conf_params.rx = 0;
    status = nrf_wifi_rt_fmac_prog_rx(ctx->rpu_ctx, &ctx->conf_params);
    if (status != NRF_WIFI_STATUS_SUCCESS) {
      RT_SHELL_PRINTF_ERROR("Disabling RX failed\n");
      ctx->conf_params.rx = 1;
      return -ENOEXEC;
    }
  }

  if (ctx->conf_params.tx) {
    RT_SHELL_PRINTF_INFO("Disabling ongoing TX test\n");
    ctx->conf_params.tx = 0;
    status = nrf_wifi_rt_fmac_prog_tx(ctx->rpu_ctx, &ctx->conf_params);
    if (status != NRF_WIFI_STATUS_SUCCESS) {
      RT_SHELL_PRINTF_ERROR("Disabling TX failed\n");
      ctx->conf_params.tx = 1;
      return -ENOEXEC;
    }
  }

  if (ctx->rf_test_run) {
    if (ctx->rf_test != NRF_WIFI_RF_TEST_TX_TONE) {
      RT_SHELL_PRINTF_ERROR("Unexpected: RF Test (%d) running\n", ctx->rf_test);
      return -ENOEXEC;
    }

    RT_SHELL_PRINTF_INFO("Disabling ongoing TX tone test\n");
    status = nrf_wifi_rt_fmac_rf_test_tx_tone(ctx->rpu_ctx, 0,
					      ctx->conf_params.tx_tone_freq,
                ctx->conf_params.tx_power);
    if (status != NRF_WIFI_STATUS_SUCCESS) {
      RT_SHELL_PRINTF_ERROR("Disabling TX tone test failed\n");
      return -ENOEXEC;
    }

    ctx->rf_test_run = false;
    ctx->rf_test = NRF_WIFI_RF_TEST_MAX;
  }

  status = nrf_wifi_radio_test_conf_init(&ctx->conf_params);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("Configuration init failed\n");
    return -ENOEXEC;
  }

  ctx->conf_params.chan.primary_num = val;

  status = nrf_wifi_rt_fmac_radio_test_init(ctx->rpu_ctx, &ctx->conf_params);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("Programming init failed\n");
    return -ENOEXEC;
  }

  return 0;
}

static int nrf_wifi_radio_test_set_tx_pkt_cw(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  long val = 0;

  val = strtol(argv[1], &ptr, 10);

  if (!((val == 0) || (val == 3) || (val == 7) || (val == 15) || (val == 31) ||
        (val == 63) || (val == 127) || (val == 255) || (val == 511) ||
        (val == 1023))) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.tx_pkt_cw = val;

  return 0;
}

static int nrf_wifi_radio_test_set_tx(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      return -ENOEXEC;
    }

