nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
    if (check_channel_settings(ctx->conf_params.tx_pkt_tput_mode,
                               &ctx->conf_params.chan) != 0) {
      RT_SHELL_PRINTF_ERROR("Invalid channel settings\n");
      return -ENOEXEC;
    }

    /** Max TX power values differ based on the test being performed.
     * For TX EVM Vs Power, Max TX power required is
     * "MAX_TX_PWR_RADIO_TEST" (24dB) whereas for testing the
     * Max TX power for which both EVM and spectrum mask are passing
     * for specific band and MCS/rate, TX power values will be read from
     * RF params string.
     */
    if (ctx->conf_params.tx_power != MAX_TX_PWR_SYS_TEST) {
      /** Max TX power is represented in 0.25dB resolution
       * So,multiply 4 to MAX_TX_PWR_RADIO_TEST and
       * configure the RF params corresponding to Max TX power.
       */
      memset(&ctx->conf_params.rf_params[NRF_WIFI_TX_PWR_CEIL_BYTE_OFFSET],
             (MAX_TX_PWR_RADIO_TEST << 2), sizeof(struct nrf_wifi_tx_pwr_ceil));
    }
  }

  ctx->conf_params.tx = val;

  status = nrf_wifi_rt_fmac_prog_tx(ctx->rpu_ctx, &ctx->conf_params);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("Programming TX failed\n");
    ctx->conf_params.tx = !val;
    return -ENOEXEC;
  }

  return 0;
}

static int nrf_wifi_radio_test_set_rx(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    return -ENOEXEC;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      return -ENOEXEC;
    }
  }

  ctx->conf_params.rx = val;

  status = nrf_wifi_rt_fmac_prog_rx(ctx->rpu_ctx, &ctx->conf_params);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("Programming RX failed\n");
    ctx->conf_params.rx = !val;
    return -ENOEXEC;
  }

  return 0;
}

#ifdef CONFIG_NRF70_SR_COEX_RF_SWITCH
static int nrf_wifi_radio_test_sr_ant_switch_ctrl(size_t argc,
                                                  const char *argv[]) {
  unsigned int val;

  if (argc < 2) {
    shell_fprintf(SHELL_ERROR, "invalid # of args : %d\n", argc);
    return -ENOEXEC;
  }

  val = strtoul(argv[1], NULL, 0);

  ctx->conf_params.sr_ant_switch_ctrl = val;

  return sr_ant_switch(val);
}
#endif /* CONFIG_NRF70_SR_COEX_RF_SWITCH */

static int nrf_wifi_radio_test_rx_cap(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  unsigned long rx_cap_type = 0;
  unsigned char *rx_cap_buf = NULL;
  unsigned char capture_status = 0;
  char *ptr = NULL;
  unsigned int i = 0;
  int ret = -ENOEXEC;

  rx_cap_type = strtoul(argv[1], &ptr, 10);

  if ((rx_cap_type != NRF_WIFI_RF_TEST_RX_ADC_CAP) &&
      (rx_cap_type != NRF_WIFI_RF_TEST_RX_STAT_PKT_CAP) &&
      (rx_cap_type != NRF_WIFI_RF_TEST_RX_DYN_PKT_CAP)) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", rx_cap_type);

    return -ENOEXEC;
  }

  if (!ctx->conf_params.capture_length) {
    RT_SHELL_PRINTF_ERROR("%s: Invalid rx_capture_length %d\n", __func__,
                          ctx->conf_params.capture_length);
    goto out;
  }

  if (rx_cap_type == NRF_WIFI_RF_TEST_RX_DYN_PKT_CAP) {
    if (!ctx->conf_params.capture_timeout) {
        RT_SHELL_PRINTF_ERROR("%s: Invalid rx_capture_timeout %d\n",__func__,
                              ctx->conf_params.capture_timeout);
    goto out;
    }
  }

  if (!check_test_in_prog()) {
    goto out;
  }

  rx_cap_buf = k_calloc((ctx->conf_params.capture_length * 3), sizeof(char));

  if (!rx_cap_buf) {
    RT_SHELL_PRINTF_ERROR("%s: Unable to allocate (%d) bytes for RX capture\n",
                          __func__, (ctx->conf_params.capture_length * 3));
    goto out;
  }

  ctx->rf_test_run = true;
  ctx->rf_test = NRF_WIFI_RF_TEST_RX_ADC_CAP;

  status = nrf_wifi_rt_fmac_rf_test_rx_cap(
      ctx->rpu_ctx, rx_cap_type, rx_cap_buf, ctx->conf_params.capture_length,
      ctx->conf_params.capture_timeout, ctx->conf_params.lna_gain, ctx->conf_params.bb_gain,
      &capture_status);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("RX ADC capture programming failed\n");
    goto out;
  }

  if (capture_status == 0) {
    RT_SHELL_PRINTF_INFO("************* RX capture data ***********\n");

    for (i = 0; i < (ctx->conf_params.capture_length); i++) {
      RT_SHELL_PRINTF_INFO("%02X%02X%02X\n", rx_cap_buf[i * 3 + 2],
                          rx_cap_buf[i * 3 + 1], rx_cap_buf[i * 3 + 0]);
    }
	} else if (capture_status == 1) {
    RT_SHELL_PRINTF_INFO("\n************* Capture failed ***********\n");
	} else {
    RT_SHELL_PRINTF_INFO("\n************* Packet detection failed ***********\n");
	}

  ret = 0;
out:
  if (rx_cap_buf)
    k_free(rx_cap_buf);

  ctx->rf_test_run = false;
  ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

  return ret;
}

static int nrf_wifi_radio_test_tx_tone(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;
  int ret = -ENOEXEC;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    goto out;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      goto out;
    }
  }

  status = nrf_wifi_rt_fmac_rf_test_tx_tone(ctx->rpu_ctx, (unsigned char)val,
					    ctx->conf_params.tx_tone_freq,
					    ctx->conf_params.tx_power);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("TX tone programming failed\n");
    goto out;
  }

  if (val == 1) {
    ctx->rf_test_run = true;
    ctx->rf_test = NRF_WIFI_RF_TEST_TX_TONE;
  } else {
    ctx->rf_test_run = false;
    ctx->rf_test = NRF_WIFI_RF_TEST_MAX;
  }

  ret = 0;
out:
  return ret;
}

static int nrf_wifi_radio_set_dpd(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;
  int ret = -ENOEXEC;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    goto out;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      goto out;
    }
  }

  ctx->rf_test_run = true;
  ctx->rf_test = NRF_WIFI_RF_TEST_DPD;

