nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
  status = nrf_wifi_rt_fmac_rf_test_dpd(ctx->rpu_ctx, val);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("DPD programming failed\n");
    goto out;
  }

  ret = 0;
out:
  ctx->rf_test_run = false;
  ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

  return ret;
}

static int nrf_wifi_radio_get_temperature(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;
  int ret = -ENOEXEC;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    goto out;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      goto out;
    }
  }

  ctx->rf_test_run = true;
  ctx->rf_test = NRF_WIFI_RF_TEST_GET_TEMPERATURE;

  status = nrf_wifi_rt_fmac_rf_get_temp(ctx->rpu_ctx);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("DPD programming failed\n");
    goto out;
  }

  ret = 0;
out:
  ctx->rf_test_run = false;
  ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

  return ret;
}

static int nrf_wifi_radio_get_rf_rssi(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;
  int ret = -ENOEXEC;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);

    goto out;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      goto out;
    }
  }

  ctx->rf_test_run = true;
  ctx->rf_test = NRF_WIFI_RF_TEST_RF_RSSI;

  status = nrf_wifi_rt_fmac_rf_get_rf_rssi(ctx->rpu_ctx);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("RF RSSI get failed\n");
    goto out;
  }

  ret = 0;
out:
  ctx->rf_test_run = false;
  ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

  return ret;
}

static int nrf_wifi_radio_set_xo_val(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  unsigned long val = 0;
  int ret = -ENOEXEC;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 0x7f) {
    RT_SHELL_PRINTF_ERROR("Invalid value XO value should be <= 0x7f\n");

    goto out;
  }

  if (val < 0) {
    RT_SHELL_PRINTF_ERROR("Invalid value XO value should be >= 0\n");

    goto out;
  }

  if (val == 1) {
    if (!check_test_in_prog()) {
      goto out;
    }
  }

  ctx->rf_test_run = true;
  ctx->rf_test = NRF_WIFI_RF_TEST_XO_CALIB;

  status = nrf_wifi_rt_fmac_set_xo_val(ctx->rpu_ctx, (unsigned char)val);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("XO value programming failed\n");
    goto out;
  }

  ctx->conf_params.rf_params[NRF_WIFI_XO_FREQ_BYTE_OFFSET] = val;

  ret = 0;
out:
  ctx->rf_test_run = false;
  ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

  return ret;
}

static int nrf_wifi_radio_comp_opt_xo_val(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

  int ret = -ENOEXEC;

  if (!check_test_in_prog()) {
    goto out;
  }

  ctx->rf_test_run = true;
  ctx->rf_test = NRF_WIFI_RF_TEST_XO_TUNE;

  status = nrf_wifi_rt_fmac_rf_test_compute_xo(ctx->rpu_ctx);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("XO value computation failed\n");
    goto out;
  }

  ret = 0;
out:
  ctx->rf_test_run = false;
  ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

  return ret;
}

static int nrf_wifi_radio_test_set_ant_gain(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long ant_gain = 0;

  ant_gain = strtoul(argv[1], &ptr, 10);

  if ((ant_gain < 0) || (ant_gain > 6)) {
    RT_SHELL_PRINTF_ERROR("Invalid antenna gain setting\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  memset(&ctx->conf_params.rf_params[ANT_GAIN_2G_OFST], ant_gain, NUM_ANT_GAIN);

  return 0;
}

static int nrf_wifi_radio_test_set_edge_bo(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long edge_bo = 0;

  edge_bo = strtoul(argv[1], &ptr, 10);

  if ((edge_bo < 0) || (edge_bo > 10)) {
    RT_SHELL_PRINTF_ERROR("Invalid edge backoff setting\n");
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  memset(&ctx->conf_params.rf_params[BAND_2G_LW_ED_BKF_DSSS_OFST], edge_bo,
         NUM_EDGE_BACKOFF);

  return 0;
}

static int nrf_wifi_radio_test_show_cfg(size_t argc, const char *argv[]) {
  struct rpu_conf_params *conf_params = NULL;

  conf_params = &ctx->conf_params;

  RT_SHELL_PRINTF_INFO("************* Configured Parameters ***********\n");
  RT_SHELL_PRINTF_INFO("\n");

  RT_SHELL_PRINTF_INFO("tx_pkt_tput_mode = %d\n",
                       conf_params->tx_pkt_tput_mode);

  RT_SHELL_PRINTF_INFO("tx_pkt_sgi = %d\n", conf_params->tx_pkt_sgi);

  RT_SHELL_PRINTF_INFO("tx_pkt_preamble = %d\n", conf_params->tx_pkt_preamble);

  RT_SHELL_PRINTF_INFO("tx_pkt_mcs = %d\n", conf_params->tx_pkt_mcs);

  if (conf_params->tx_pkt_rate == 5)
    RT_SHELL_PRINTF_INFO("tx_pkt_rate = 5.5\n");
  else
    RT_SHELL_PRINTF_INFO("tx_pkt_rate = %d\n", conf_params->tx_pkt_rate);

  RT_SHELL_PRINTF_INFO("tx_pkt_gap = %d\n", conf_params->tx_pkt_gap_us);

  RT_SHELL_PRINTF_INFO(
      "phy_calib_rxdc = %d\n",
      (conf_params->phy_calib & NRF_WIFI_PHY_CALIB_FLAG_RXDC) ? 1 : 0);

  RT_SHELL_PRINTF_INFO(
      "phy_calib_txdc = %d\n",
      (conf_params->phy_calib & NRF_WIFI_PHY_CALIB_FLAG_TXDC) ? 1 : 0);

  RT_SHELL_PRINTF_INFO(
      "phy_calib_txpow = %d\n",
      (conf_params->phy_calib & NRF_WIFI_PHY_CALIB_FLAG_TXPOW) ? 1 : 0);

  RT_SHELL_PRINTF_INFO(
      "phy_calib_rxiq = %d\n",
      (conf_params->phy_calib & NRF_WIFI_PHY_CALIB_FLAG_RXIQ) ? 1 : 0);

  RT_SHELL_PRINTF_INFO(
      "phy_calib_txiq = %d\n",
      (conf_params->phy_calib & NRF_WIFI_PHY_CALIB_FLAG_TXIQ) ? 1 : 0);

  RT_SHELL_PRINTF_INFO("tx_pkt_num = %d\n", conf_params->tx_pkt_num);

  RT_SHELL_PRINTF_INFO("tx_pkt_len = %d\n", conf_params->tx_pkt_len);

  RT_SHELL_PRINTF_INFO("tx_power = %d\n", conf_params->tx_power);

  RT_SHELL_PRINTF_INFO("he_ltf = %d\n", conf_params->he_ltf);

  RT_SHELL_PRINTF_INFO("he_gi = %d\n", conf_params->he_gi);

  RT_SHELL_PRINTF_INFO("xo_val = %d\n",
                       conf_params->rf_params[NRF_WIFI_XO_FREQ_BYTE_OFFSET]);

