nrfconnect/nrf70-bm/samples/radio_test_bm/src/nrf_wifi_radio_test_shell.c
  RT_SHELL_PRINTF_INFO("init = %d\n", conf_params->chan.primary_num);

  RT_SHELL_PRINTF_INFO("tx = %d\n", conf_params->tx);

  RT_SHELL_PRINTF_INFO("rx = %d\n", conf_params->rx);

  RT_SHELL_PRINTF_INFO("tx_tone_freq = %d\n", conf_params->tx_tone_freq);

  RT_SHELL_PRINTF_INFO("rx_lna_gain = %d\n", conf_params->lna_gain);

  RT_SHELL_PRINTF_INFO("rx_bb_gain = %d\n", conf_params->bb_gain);

  RT_SHELL_PRINTF_INFO("rx_capture_length = %d\n", conf_params->capture_length);

  RT_SHELL_PRINTF_INFO("rx_capture_timeout = %d\n", conf_params->capture_timeout);
#if defined(CONFIG_BOARD_NRF7002DK_NRF7001_NRF5340_CPUAPP) ||                  \
    defined(CONFIG_BOARD_NRF7002DK_NRF5340_CPUAPP)
  RT_SHELL_PRINTF_INFO("sr_ant_switch_ctrl = %d\n",
                       conf_params->sr_ant_switch_ctrl);
#endif /* CONFIG_BOARD_NRF700XDK_NRF5340 */

  RT_SHELL_PRINTF_INFO("wlan_ant_switch_ctrl = %d\n",
                       conf_params->wlan_ant_switch_ctrl);
  RT_SHELL_PRINTF_INFO("tx_pkt_cw = %d\n", conf_params->tx_pkt_cw);

  RT_SHELL_PRINTF_INFO("reg_domain = %c%c\n", conf_params->country_code[0],
                       conf_params->country_code[1]);

  RT_SHELL_PRINTF_INFO("bypass_reg_domain = %d\n",
                       conf_params->bypass_regulatory);

  RT_SHELL_PRINTF_INFO("ru_tone = %d\n", conf_params->ru_tone);

  RT_SHELL_PRINTF_INFO("ru_index = %d\n", conf_params->ru_index);

  return 0;
}

static int nrf_wifi_radio_test_get_stats(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  struct rpu_rt_op_stats stats;

  memset(&stats, 0, sizeof(stats));

  status =
      nrf_wifi_rt_fmac_stats_get(ctx->rpu_ctx, ctx->conf_params.op_mode, &stats);

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("nrf_wifi_fmac_stats_get failed\n");
    return -ENOEXEC;
  }

  RT_SHELL_PRINTF_INFO("************* PHY STATS ***********\n");

  RT_SHELL_PRINTF_INFO("rssi_avg = %d dBm\n", stats.fw.phy.rssi_avg);

  RT_SHELL_PRINTF_INFO("ofdm_crc32_pass_cnt=%d\n",
                       stats.fw.phy.ofdm_crc32_pass_cnt);

  RT_SHELL_PRINTF_INFO("ofdm_crc32_fail_cnt=%d\n",
                       stats.fw.phy.ofdm_crc32_fail_cnt);

  RT_SHELL_PRINTF_INFO("dsss_crc32_pass_cnt=%d\n",
                       stats.fw.phy.dsss_crc32_pass_cnt);

  RT_SHELL_PRINTF_INFO("dsss_crc32_fail_cnt=%d\n",
                       stats.fw.phy.dsss_crc32_fail_cnt);

  return 0;
}

/* See enum CD2CM_MSG_ID_T in RPU Coexistence Manager API */
#define CD2CM_UPDATE_SWITCH_CONFIG 0x7
static int nrf_wifi_radio_test_wlan_switch_ctrl(size_t argc,
                                                const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  char *ptr = NULL;
  struct coex_wlan_switch_ctrl params = {0};

  if (argc < 2) {
    RT_SHELL_PRINTF_ERROR("Invalid number of parameters\n");

    return -ENOEXEC;
  }

  params.rpu_msg_id = CD2CM_UPDATE_SWITCH_CONFIG;
  params.switch_A = strtoul(argv[1], &ptr, 10);

  if (params.switch_A > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid WLAN switch config (%d)\n", params.switch_A);

    return -ENOEXEC;
  }

  ctx->conf_params.wlan_ant_switch_ctrl = params.switch_A;

  status = nrf_wifi_fmac_conf_srcoex(ctx->rpu_ctx, &params, sizeof(params));

  if (status != NRF_WIFI_STATUS_SUCCESS) {
    RT_SHELL_PRINTF_ERROR("WLAN switch configuration failed\n");
    return -ENOEXEC;
  }

  return 0;
}

static int nrf_wifi_radio_test_reg_domain(size_t argc, const char *argv[]) {
  enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
  int ret = -ENOEXEC;
  struct nrf70_bm_regulatory_info reg_domain_info = {0};

  if (argv[1]) {
    if (strlen(argv[1]) != 2) {
      RT_SHELL_PRINTF_WARNING(
          "Invalid reg domain: Length should be two letters/digits\n");
      goto out;
    }

    /* Two letter country code with special case of 00 for WORLD */
    if (((argv[1][0] < 'A' || argv[1][0] > 'Z') ||
         (argv[1][1] < 'A' || argv[1][1] > 'Z')) &&
        (argv[1][0] != '0' || argv[1][1] != '0')) {
      RT_SHELL_PRINTF_WARNING("Invalid reg domain %c%c\n", argv[1][0],
                              argv[2][1]);
      goto out;
    }

    ctx->conf_params.country_code[0] = argv[1][0];
    ctx->conf_params.country_code[1] = argv[1][1];

    if (!check_test_in_prog()) {
      goto out;
    }

    memcpy(reg_domain_info.country_code,
           ctx->conf_params.country_code,
           NRF_WIFI_COUNTRY_CODE_LEN);

    status = nrf70_bm_rt_set_reg(&reg_domain_info);

    if (status != NRF_WIFI_STATUS_SUCCESS) {
      RT_SHELL_PRINTF_ERROR("Regulatory programming failed\n");
      goto out;
    }
  } else {
    reg_domain_info.chan_info = malloc(sizeof(struct nrf70_bm_reg_chan_info) * NRF70_MAX_CHANNELS);
    if (!reg_domain_info.chan_info) {
      printf("Failed to allocate memory for regulatory info\n");
      goto out;
    }

    memset(reg_domain_info.chan_info,
           0,
           (sizeof(struct nrf70_bm_reg_chan_info) * NRF70_MAX_CHANNELS));

    status = nrf70_bm_rt_get_reg(&reg_domain_info);

    if (status != NRF_WIFI_STATUS_SUCCESS) {
      RT_SHELL_PRINTF_ERROR("Regulatory information get failed\n");
      goto out;
    }

    RT_SHELL_PRINTF_INFO("Reg domain set to: %s\n", reg_domain_info.country_code);
  }

  ret = 0;
out:
  if (reg_domain_info.chan_info) {
    free(reg_domain_info.chan_info);
  }
  return ret;
}

static int nrf_wifi_radio_test_set_bypass_reg(size_t argc, const char *argv[]) {
  char *ptr = NULL;
  unsigned long val = 0;

  val = strtoul(argv[1], &ptr, 10);

  if (val > 1) {
    RT_SHELL_PRINTF_ERROR("Invalid value %lu\n", val);
    return -ENOEXEC;
  }

  if (!check_test_in_prog()) {
    return -ENOEXEC;
  }

  ctx->conf_params.bypass_regulatory = val;

  return 0;
}

#ifdef CONFIG_ZEPHYR_SHELL
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_defaults)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_phy_calib_rxdc)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_phy_calib_txdc)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_phy_calib_txpow)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_phy_calib_rxiq)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_phy_calib_txiq)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_he_ltf)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_he_gi)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_tput_mode)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_sgi)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_preamble)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_mcs)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_rate)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_gap)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_num)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_len)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_power)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_ru_tone)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_ru_index)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_init)
DEFINE_CMD_HANDLER(nrf_wifi_init);
DEFINE_CMD_HANDLER(nrf_wifi_deinit);
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_rx)
#ifdef CONFIG_NRF70_SR_COEX_RF_SWITCH
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_sr_ant_switch_ctrl)
#endif /* CONFIG_NRF70_SR_COEX_RF_SWITCH */
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_rx_lna_gain)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_rx_bb_gain)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_rx_capture_length)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_rx_capture_timeout)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_rx_cap)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_tone_freq)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_tx_tone)
DEFINE_CMD_HANDLER(nrf_wifi_radio_set_dpd)
DEFINE_CMD_HANDLER(nrf_wifi_radio_get_temperature)
DEFINE_CMD_HANDLER(nrf_wifi_radio_get_rf_rssi)
DEFINE_CMD_HANDLER(nrf_wifi_radio_set_xo_val)
DEFINE_CMD_HANDLER(nrf_wifi_radio_comp_opt_xo_val)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_show_cfg)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_get_stats)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_wlan_switch_ctrl)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_tx_pkt_cw)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_reg_domain)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_bypass_reg)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_ant_gain)
DEFINE_CMD_HANDLER(nrf_wifi_radio_test_set_edge_bo)


SHELL_STATIC_SUBCMD_SET_CREATE(
    nrf_wifi_radio_test_subcmds,
    SHELL_CMD_ARG(set_defaults, NULL,
                  "Reset configuration parameter to their default values",
                  RTSH(nrf_wifi_radio_test_set_defaults), 1, 0),
    SHELL_CMD_ARG(phy_calib_rxdc, NULL,
                  "0 - Disable RX DC calibration\n"
                  "1 - Enable RX DC calibration",
                  RTSH(nrf_wifi_radio_test_set_phy_calib_rxdc), 2, 0),
    SHELL_CMD_ARG(phy_calib_txdc, NULL,
                  "0 - Disable TX DC calibration\n"
                  "1 - Enable TX DC calibration",
                  RTSH(nrf_wifi_radio_test_set_phy_calib_txdc), 2, 0),
    SHELL_CMD_ARG(phy_calib_txpow, NULL,
                  "0 - Disable TX power calibration\n"
                  "1 - Enable TX power calibration",
                  RTSH(nrf_wifi_radio_test_set_phy_calib_txpow), 2, 0),
    SHELL_CMD_ARG(phy_calib_rxiq, NULL,
                  "0 - Disable RX IQ calibration\n"
                  "1 - Enable RX IQ calibration",
                  RTSH(nrf_wifi_radio_test_set_phy_calib_rxiq), 2, 0),
    SHELL_CMD_ARG(phy_calib_txiq, NULL,
                  "0 - Disable TX IQ calibration\n"
                  "1 - Enable TX IQ calibration",
                  RTSH(nrf_wifi_radio_test_set_phy_calib_txiq), 2, 0),
    SHELL_CMD_ARG(he_ltf, NULL,
                  "0 - 1x HE LTF\n"
                  "1 - 2x HE LTF\n"
                  "2 - 4x HE LTF                                        ",
                  RTSH(nrf_wifi_radio_test_set_he_ltf), 2, 0),
    SHELL_CMD_ARG(he_gi, NULL,
                  "0 - 0.8 us\n"
                  "1 - 1.6 us\n"
                  "2 - 3.2 us                                           ",
                  RTSH(nrf_wifi_radio_test_set_he_gi), 2, 0),
    SHELL_CMD_ARG(tx_pkt_tput_mode, NULL,
                  "0 - Legacy mode\n"
                  "1 - HT mode\n"
#ifndef CONFIG_NRF70_2_4G_ONLY
                  "2 - VHT mode\n"
#endif /* CONFIG_NRF70_2_4G_ONLY */
                  "3 - HE(SU) mode\n"
                  "4 - HE(ER SU) mode\n"
                  "5 - HE (TB) mode                                   ",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_tput_mode), 2, 0),
    SHELL_CMD_ARG(tx_pkt_sgi, NULL,
                  "0 - Disable\n"
                  "1 - Enable",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_sgi), 2, 0),
    SHELL_CMD_ARG(tx_pkt_preamble, NULL,
                  "0 - Long preamble\n"
                  "1 - Short preamble\n"
                  "2 - Mixed preamble                                   ",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_preamble), 2, 0),
    SHELL_CMD_ARG(tx_pkt_mcs, NULL,
                  "-1    - Not being used\n"
                  "<val> - MCS index to be used",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_mcs), 2, 0),
    SHELL_CMD_ARG(tx_pkt_rate, NULL,
                  "-1    - Not being used\n"
                  "<val> - Legacy rate to be used in Mbps (1, 2, 5.5, 11, 6, "
                  "9, 12, 18, 24, 36, 48, 54)",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_rate), 2, 0),
    SHELL_CMD_ARG(tx_pkt_gap, NULL,
                  "<val> - Interval between TX packets in us (Min: 200, Max: "
                  "200000, Default: 200)",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_gap), 2, 0),
    SHELL_CMD_ARG(tx_pkt_num, NULL,
                  "-1    - Transmit infinite packets\n"
                  "<val> - Number of packets to transmit",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_num), 2, 0),
    SHELL_CMD_ARG(tx_pkt_len, NULL,
                  "<val> - Length of the packet (in bytes) to be transmitted "
                  "(Default: 1400)",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_len), 2, 0),
    SHELL_CMD_ARG(tx_power, NULL, "<val> - Value in dBm",
                  RTSH(nrf_wifi_radio_test_set_tx_power), 2, 0),
    SHELL_CMD_ARG(ru_tone, NULL,
                  "<val> - Resource unit (RU) size (26,52,106 or 242)",
                  RTSH(nrf_wifi_radio_test_set_ru_tone), 2, 0),
    SHELL_CMD_ARG(ru_index, NULL,
                  "<val> - Location of resource unit (RU) in 20 MHz spectrum\n"
                  "        Valid Values:\n"
                  "           For 26 ru_tone: 1 to 9\n"
                  "           For 52 ru_tone:  1 to 4\n"
                  "           For 106 ru_tone:  1 to 2\n"
                  "           For 242 ru_tone:  1",
                  RTSH(nrf_wifi_radio_test_set_ru_index), 2, 0),
    SHELL_CMD_ARG(init, NULL, "<val> - Primary channel number",
                  RTSH(nrf_wifi_radio_test_init), 2, 0),
    SHELL_CMD_ARG(nrf70_init, NULL, "Initialize nRF70",
                  RTSH(nrf_wifi_init), 0, 0),
    SHELL_CMD_ARG(nrf70_deinit, NULL, "Deinitialize nRF70",
                  RTSH(nrf_wifi_deinit), 0, 0),
    SHELL_CMD_ARG(tx, NULL,
                  "0 - Disable TX\n"
                  "1 - Enable TX",
                  RTSH(nrf_wifi_radio_test_set_tx), 2, 0),
    SHELL_CMD_ARG(rx, NULL,
                  "0 - Disable RX\n"
                  "1 - Enable RX",
                  RTSH(nrf_wifi_radio_test_set_rx), 2, 0),
#ifdef CONFIG_NRF70_SR_COEX_RF_SWITCH
    SHELL_CMD_ARG(sr_ant_switch_ctrl, NULL,
                  "0 - Switch set to use the BLE antenna\n"
                  "1 - Switch set to use the shared Wi-Fi antenna",
                  RTSH(nrf_wifi_radio_test_sr_ant_switch_ctrl), 2, 0),
#endif /* CONFIG_NRF70_SR_COEX_RF_SWITCH */
    SHELL_CMD_ARG(rx_lna_gain, NULL,
                  "<val> - LNA gain to be configured.\n"
                  "0 = 24 dB\n"
                  "1 = 18 dB\n"
                  "2 = 12 dB\n"
                  "3 = 0 dB\n"
                  "4 = -12 dB                         ",
                  RTSH(nrf_wifi_radio_test_set_rx_lna_gain), 2, 0),
    SHELL_CMD_ARG(rx_bb_gain, NULL,
                  "<val> - Baseband gain to be configured\n"
                  "It is a 5 bit value. Supports 64dB range in steps of 2dB",
                  RTSH(nrf_wifi_radio_test_set_rx_bb_gain), 2, 0),
    SHELL_CMD_ARG(rx_capture_length, NULL,
                  "<val> - Number of RX samples to be captured\n"
                  "Max allowed length is 16384 complex samples",
                  RTSH(nrf_wifi_radio_test_set_rx_capture_length), 2,
                  0),
    SHELL_CMD_ARG(rx_capture_timeout, NULL,
                  "<val> - Wait time allowed in seconds\n"
                  "Max timeout allowed is 600 seconds",
                  RTSH(nrf_wifi_radio_test_set_rx_capture_timeout), 2,
                  0),
    SHELL_CMD_ARG(rx_cap, NULL,
                  "0 = ADC capture\n"
                  "1 = Static packet capture\n"
                  "2 = Dynamic packet captur              ",
                  RTSH(nrf_wifi_radio_test_rx_cap), 2, 0),
    SHELL_CMD_ARG(tx_tone_freq, NULL,
                  "<val> - Frequency offset with respect to center frequency in the range of -10 MHz to 10 MHz (resolution 1 MHz)",
                  RTSH(nrf_wifi_radio_test_set_tx_tone_freq), 2, 0),
    SHELL_CMD_ARG(tx_tone, NULL,
                  "<TONE CONTROL>\n"
                  "0: Disable tone\n"
                  "1: Enable tone                                       ",
                  RTSH(nrf_wifi_radio_test_tx_tone), 2, 0),
    SHELL_CMD_ARG(dpd, NULL,
                  "0 - Bypass DPD\n"
                  "1 - Enable DPD",
                  RTSH(nrf_wifi_radio_set_dpd), 2, 0),
    SHELL_CMD_ARG(get_temperature, NULL, "No arguments required",
                  RTSH(nrf_wifi_radio_get_temperature), 1, 0),
    SHELL_CMD_ARG(get_rf_rssi, NULL, "No arguments required",
                  RTSH(nrf_wifi_radio_get_rf_rssi), 1, 0),
    SHELL_CMD_ARG(set_xo_val, NULL, "<val> - XO value in the range 0 to 127",
                  RTSH(nrf_wifi_radio_set_xo_val), 2, 0),
    SHELL_CMD_ARG(compute_optimal_xo_val, NULL, "Compute optimal XO trim value",
                  RTSH(nrf_wifi_radio_comp_opt_xo_val), 1, 0),
    SHELL_CMD_ARG(show_config, NULL, "Display the current configuration values",
                  RTSH(nrf_wifi_radio_test_show_cfg), 1, 0),
    SHELL_CMD_ARG(get_stats, NULL, "Display statistics",
                  RTSH(nrf_wifi_radio_test_get_stats), 1, 0),
    SHELL_CMD_ARG(wlan_ant_switch_ctrl, NULL,
                  "Configure WLAN antenna switch (0-separate/1-shared)",
                  RTSH(nrf_wifi_radio_test_wlan_switch_ctrl), 2, 0),
    SHELL_CMD_ARG(tx_pkt_cw, NULL,
                  "<val> - Contention window value to be configured (0, 3, 7, "
                  "15, 31, 63, 127, 255, 511, 1023)",
                  RTSH(nrf_wifi_radio_test_set_tx_pkt_cw), 2, 0),
    SHELL_CMD_ARG(reg_domain, NULL,
                  "Configure WLAN regulatory domain country code",
                  RTSH(nrf_wifi_radio_test_reg_domain), 1, 1),
    SHELL_CMD_ARG(
        bypass_reg_domain, NULL,
        "Configure WLAN to bypass regulatory\n"
        "0 - TX power of the channel will be set to "
        "minimum between user configured TX power & "
        "maximum TX power of channel in the configured regulatory domain.\n"
        "1 - Configured TX power value will be used for the channel.	"
        "			",
        RTSH(nrf_wifi_radio_test_set_bypass_reg), 2, 0),
    SHELL_CMD_ARG(set_ant_gain, NULL,
                  "<val> - Antenna gain in dB (Min: 0, Max: 6)",
                  RTSH(nrf_wifi_radio_test_set_ant_gain), 2, 0),
    SHELL_CMD_ARG(set_edge_bo, NULL,
                  "<val> - Edge backoff in dB (Min: 0, Max: 10)",
                  RTSH(nrf_wifi_radio_test_set_edge_bo), 2, 0),
    SHELL_SUBCMD_SET_END);

SHELL_CMD_REGISTER(wifi_radio_test, &nrf_wifi_radio_test_subcmds,
                   "nRF Wi-Fi radio test commands", NULL);
#endif /* CONFIG_ZEPHYR_SHELL */

int nrf_wifi_radio_test_shell_init(void)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

	status = nrf_wifi_radio_test_conf_init(&ctx->conf_params);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		return -ENOEXEC;
	}

	return 0;
}
